{
	"rolling.grid.title" : "Grid Component",
	"rolling.grid.sub" : "As the most useful component, it provides various convenient\nfunctions to quickly load data and search effectively.\nExperience the amazing features and performance of this grid component!",
	"rolling.component.title" : "Nexacro Components",
	"rolling.component.sub" : "Over 80 components and libraries reduce the time required to build web applications and provide a more convenient user environment.\nCreate your web applications more easily by using various component!",
	"rolling.useful.title" : "Useful Features",
	"rolling.useful.sub" : "It provides more convenient functions such as web widgets, shortcut keys, personalization, drag & drop interface, etc. by using components and libraries in a complex way.\nCheck it out through samples that have been used in various ways!",
	"rolling.interface.title" : "Interface & Extension",
	"rolling.interface.sub" : "In order to compose a rich UI/UX, in addition to basic components, 3rd party or open source libraries are linked.\nWe provide a convenient interface extension function for this linkage, and check it out through various examples!",
	"main.learnmore" : "Learn More",
	"osmu.desc" : "Nexacro Platform is the only Real OSMU solution that breaks the boundaries between web and native and builds an IT environment that perfectly responds to all business environments with one source. Increase your company value by realizing user-centered UI·UX systems!",
	"ide" : "Increase dev-productivity",
	"ide.desc" : "Nexacro Studio has been reborn as the best development tool through the analysis of availability models and actual user tests. It greatly enhances functions that improve the convenience of developers and provides respective interface for designers, publishers and others.",
	"go.to.ask": "Go to Ask",
	"source.download": "Source Download",
	"scroll.to.top": "Scroll to top",
	"tobesoft": "TOBESOFT",
	"support.center": "Support Center",
	"tobetong": "TOBETONG",
	"apply.education": "Apply for Education",
	"technical.documents": "Technical Documents",
	"copyright.short": "617, Bongeunsa-ro, Gangnam-gu, Seoul, Korea  I  +82-2-2140-7700\nCOPYRIGHT©TOBESOFT.CO.LTD. ALL RIGHTS RESERVED",
	"copyright.long": "Intops Building, 617, Bongeunsa-ro, Gangnam-gu, Seoul, Korea  I  CEO : Kyon Chan Lee  I  Phone : +82-2-2140-7700\nCOPYRIGHT© BY 2021 TOBESOFT.CO.LTD. ALL RIGHTS RESERVED",
	"grid.function": "Function",
	"range.of.selection": "Range of selection",
	"types.of.scrolling": "Types of scrolling",
	"inquiry.result": "Inquiry result",
	"total": "Total",
	"name": "Name",
	"company": "Company",
	"cell.phone": "Cell Phone",
	"email": "E-mail",
	"address": "Address",
	"preview": "Preview",
	"menu.component": "Menu Component",
	"mega.menu": "MegaMenu",
	"various.menu": "TreeMenu, AutoMenu, AccordionMenu",
	"grid.rowcount": "Row count",
	"grid.function.sort.title.desc" : "Click the grid header (use control key for multi-sort) or click the 'Multi-sort' button.'",
	"grid.function.sort.button" : "Multi Sort",
	"grid.function.find" : "Find",
	"grid.function.find.direction" : "Direction",
	"grid.function.find.scope" : "Scope",
	"grid.function.find.condition" : "Condition",
	"grid.function.find.position" : "Position",
	"grid.function.find.word" : "word",
	"grid.function.case" : "case sensitive",
	"grid.function.option" : "Option",
	"grid.function.close" : "Close",
	"grid.function.staRange":"Range of selection",
	"grid.function.staScroll":"Types of scrolling",
	"grid.function.staSearch":"search",
	"grid.function.sort": "Sort",
	"grid.function.sort.desc": "You can sort the data by the field values that the column references by clicking the column header in the grid. Clicking the same field repeatedly converts it to an ascending/ descending/cancel state; pressing the 'Ctrl' key and clicking the header allows you to sort multiple columns in the order you clicked.\n\nYou can also sort through the context menu that appears when you right-click in the header area of the grid. Selecting 'Multiple Sort' in the context menu invokes a pop-up screen, allows you to add rows by pressing the '+' button, select the column name and sort order, and press the 'Apply' button to sort.",
	"grid.function.filter": "Filter",
	"grid.function.filter.desc": "If you select 'Filter' in the context menu that appears when you right-click in the header area of the column to which you want to apply the filter, a pop-up screen will be called, and the 'Apply' button will be pressed to display only rows corresponding to the filter conditions.\n\nClick the 'conditional filter' button to apply the filter through a conditional expression.",
	"grid.function.selection": "Selection",
	"grid.function.selection.desc": "You can use the 'selecttype' property of the grid to specify the region selection of the grid in various ways.\nYou can change the 'Range of selection' of the conditions at the top of the screen and see how the grid body area is selected.\n(Type : row, area, cell, multi row, multi area)",
	"grid.function.smartscroll": "Smart Scroll",
	"grid.function.smartscroll.desc": "The Grid component displays a scroll bar as there are more rows of data to display on the screen. In this case, you will navigate through the data by moving the scroll bar, and you will need to move the scroll bar and continue to display the data displayed on the screen. From a browser perspective, displaying data while moving the scrollbar can be a burden, and from the user's point of view, it's not easy to move the scrollbar and find the data they want.\nThe Smart Scroll feature is a tip-like feature that eliminates some of these inconveniences. The Smart Scroll function is applicable by setting the 'fastvscrolltype' property value on the Grid component.\n(Type : default, top display, center display, top&bottom display, top&center&bottom display, trackbar follow)",
	"grid.function.exportdata": "Export Data",
	"grid.function.exportdata.desc" : "You can download the data shown in the grid to a file in Excel or CSV format. Use 'ExcelExportObject' to convert the on-screen grid to a file, and when finished, a file download dialog appears and can be saved to a local PC.\n\nSelect 'Export to Excel' or 'Export to CSV' from the context menu that appears when you right-click in the grid area.",
	"grid.function.statue":"Data statue",
	"grid.function.statue.desc":"It displays the status of the data row (search, modification, deletion, etc.). Modifying the data changes the data type.",
	"grid.function.search":"Search",
	"grid.function.search.desc":"Search for data in the grid. Enter the word you want to search at the top of the grid and hit enter or use the search button to select the data in sequence.",
	"grid.function.hierarchycombo":"Hierarchy ComboBox",
	"grid.function.hierarchycombo.desc":"The combo data of the department, which is the lower combo, is changed according to the combo value of the work column, which is the upper concept.",
	"grid.copypaste.title":"Copy & Paste Grid Data",
	"grid.copypaste.subtitle":"selected data can copy to the clipboard with the shortcut key (Ctrl + c/v), or paste the data from the clipboard into a grid or Excel program",
	"grid.copypaste.selection.option":"Grid selection type",
	"grid.copypaste.selection.remark":"※ Use Shift, Ctrl keys for multiple selection",
	"grid.copypaste.desc":"This is a function that utilizes the PC's clipboard.\nIt provides convenience to copy the selected data on the grid to the clipboard or paste the copied data to the grid or Excel program.",
	"grid.freezepanes.title":"Grid freeze panes",
	"grid.freezepanes.subtitle":"This function freezes the selected cell when scrolling. After selecting the Area, Freeze it through the button or context menu(mouse right-button).",
	"grid.freezepanes.btnRowFix":"Row freezing",
	"grid.freezepanes.btnColFix":"Column freezing",
	"grid.freezepanes.btnCellFix":"Row & Column freezing",
	"grid.freezepanes.brnFixFree":"Cancel",
	"grid.freezepanes.desc":"The frame freezing function is that allows you to effectively scroll through a lot of data expressed in the grid component.\nIf you standardize the grid context menu as in this sample, you can further increase the convenience of using the grid.",
	"grid.smartscroll.title":"Smart Scroll",
	"grid.smartscroll.subtitle":"Supports high-speed scrolling even in grids with many expressions applied or loaded with large amounts of data. Select the scroll type and move the track bar on the right side of the grid with the mouse.",
	"grid.smartscroll.staScrollType":"Scroll Type",
	"grid.renderer": "Renderer",
	"grid.cell.display.type": "Cell display type",
	"grid.tree.grouping": "Tree grouping",
	"grid.tree.grouping.collapse": "Collapse",
	"grid.tree.grouping.expand": "Expand",
	"grid.cell.display.type.desc": "A cell is one of the objects that make up the grid and has a separate property from the grid. You can bind columns in Dataset and use them, or you can set the displaytype and edittype properties of the cell to express them in components such as Button, Combo, CheckBox, Image, ProgressBar, Edit, or Tree.\n\nDepending on the 'displaytype' property setting for each cell of the grid component, various expressions such as buttons and images are possible.\n'displaytype' is a property that sets the format in which the bounded data is displayed on the screen when the cell is not in editing, providing 19 default formats and, if not set separately, is automatically displayed for the bound data type.",
	"grid.tree.grouping.desc": "If the cell's 'displaytype' property is set to 'treetitemcontol', the cell area is displayed in the form of a tree control, and the bound data is displayed in text on the control.\nIf you set the tree-related properties of a cell (treelevel, treastate, etc.) and set 'editttype' to 'tree', click the tree button displayed in the cell to enable the tree to Collapse/Expand.\nYou can group columns through the 'keystring' property of a bound dataset to display subtotals together in the grid.",
	"grid.multi.format": "Multi format",
	"grid.multi.format.desc": "If you need to look at the same data from various perspectives or hide some of the data according to permissions, you can use multiple formats in a grid to process the data.",
	"grid.multi.format.editor.desc": "In the Grid Contents Editor, where you edit the grid, you can add a new Format, copy an existing Format, and then modify some of the items.\nWhen you apply Format in Grid, specify the 'formatid' property value to select the desired Format.",
	"grid.expression": "Expression",
	"grid.expression.desc": "When you enter numeric values in the A and B columns, the cell's expr property displays the A+B, A*B results in the next cell. A simple expression can be expressed directly in an expr property, if the expression is long or complicated.\nYou can call by defining a user function.\nIn addition to the displayed text values, you can also apply extpr to each cell's properties, such as displaytype or cssclass. Selecting a value from the combo in the C column converts the next column to Edit or Combo, depending on the selected value.",
	"grid.pagination": "Pagination",
	"grid.pagination.desc": "The grid on the Nexacro can represent a lot of data at a time. However, there are many ways to express data when it is split into pages based on customer needs.\nYou can apply the desired method, such as unlimited scrolling to look up the next data when scrolling or using commonly used page navigation, and adding the next data when clicking the button, and this paging processing can be registered as a common module using the components provided by the Nexacro.",
	"grid.pagination.buttonstyle": "Button style",
	"grid.pagination.buttonstyle.desc": "The most commonly used paging processing method is expressed with paging buttons. Click the button on the page number to view and express the data again.\nYou can choose the default number of cases (for example, 10 to 50) that can be expressed per page, and you can also apply shortcuts so that you can go straight to the page you want.",
	"grid.pagination.infinitescrolling": "Infinite scrolling",
	"grid.pagination.infinitescrolling.desc": "In the data area of the grid, when you use the mouse wheel to lower the bottom or the end of the scroll trackbar, the next data is automatically added by looking up.\nThis can cause performance degradation if too much data is loaded, as it continues to add data when scrolling.\nYou can also apply the method of adding data when you click a button, such as 'Show more results' without scrolling.",
	"grid.export.import": "Export & Import",
	"grid.export": "Export",
	"grid.export.type": "Export type",
	"grid.import": "Import",
	"grid.import.type": "Import type",
	"grid.import.include.header": "Include Column Names as Header",
	"grid.import.password": "Password",
	"grid.import.download.testfile": "Download Test File",
	"grid.export.desc": "The Nexacro provides nexacro-xeni for Excel export and import processing. nexacro-xeni is a server application that processes Excel's exports/imports on the server and then returns the results.\nThe hassle of handling Excel export/import functions through server applications is that processing Excel files requires resources from the local system. This can cause serious security problems and is being prevented by the browser. Therefore, Nexacro provides a method using nexacro-xeni.\n\nnexacro-xeni is based on Apache POI. Therefore, Apache POI may be used but is not responsible for the problems that arise. For more information, see <l v='https://poi.apache.org/'>https://poi.apache.org/</l>.\n\nExcelExportObject is an object used to export the contents of the Grid to an Excel file. This object allows developers to perform the necessary settings for the export and requests to the server.\nExpotable formats include Excel97(xls), Excel2007(xlsx), Hancell2010, Hancell2014, and CSV.\nSelect the type of export in the demo and click the Export button to download the file and check it out.",
	"grid.import.desc": "ExcelImportObject is an object that you use to import the contents of an Excel file to Grid. Responsible for the setup required for the import and for requests to the server. Developers can use it in scripts to import Excel.\nImportable formats include Excel97(xls), Excel2007(xlsx), Hancell2014, and CSV.\nAfter selecting the type of import in the demo, click the Import button to upload the file and view the data for each sheet on the screen. When using the \"Include column names as header\" option, use the text in the first row as a column in the dataset. If the password is set in the excel file, enter a value in the password field on the screen and import it to retrieve the data after decryption.\nIf you do not have a suitable test file, download the sample file and import it.",
	"grid.personalization": "Personalization",
	"grid.personalization.default": "Set Default",
	"grid.personalization.save": "Save",
	"grid.personalization.desc": "Recently, there has been a lot of demand for personalization features from system users. After changing the order or size of the column defined by the developer, I want the format to be maintained the next time I connect to the system.\nPersonalization functions can be used using API provided by grid of Nexacro and Local Storage provided by HTML5.",
	"grid.personalization.cellmoving": "Cell moving",
	"grid.personalization.cellmoving.desc": "Setting the cellmovingtype property of the grid allows the user to change the position of the column using mouse drag and drop.",
	"grid.personalization.cellsizing": "Cell sizing",
	"grid.personalization.cellsizing.desc": "In some cases, if a cell in a grid contains a large amount of data, you may not be able to see the entire content. If you have the ability to freely adjust column and low size, as in Excel, you can use the grid more comfortably.\nThe cellsizingtype property changes the pointer when the user moves the mouse over the cell or the border of the head, and in that state, press and move the mouse button to change the size of the cell.",
	"grid.personalization.columnhiding": "Column hiding",
	"grid.personalization.columnhiding.desc": "Right-clicking a column that you want to hide will display a context menu, and clicking the Hide Column menu will make the column invisible. When displaying hidden columns again, they are displayed again by right-clicking any column in the Head Area and selecting 'Show all columns' or a specific column in the context menu.",
	"grid.personalization.default.desc": "If you press the 'Save' button to save this changed format information and access this screen again, the saved format will be automatically applied. Pressing the 'Initialization' button applies the default format defined by the developer.",
	"grid.largedata": "Large Data",
	"grid.largedata.desc": "A typical web page does not represent a lot of data in the grid at a time. There is a problem with memory or performance, so it will be paged.\nBut from the point of view of business people, it's easy to load a lot of data on the web at once, just like Excel or C/S-based systems, so it's a feature that many customers require.\nBecause the Nexacro manages data through datasets and renders only as much data as is shown in the grid, thousands or tens of thousands of data can be viewed quickly.",
	"grid.largedata.query": "Large data query",
	"grid.largedata.query.desc": "Under Search Criteria, select the number of data (10,000/50,000/100,000) and click the Inquiry button. At the end of the query, the data is rendered in the grid and displayed on the screen, separating the server/network interval and the rendering time.",
	"grid.pivot": "Pivot",
	"grid.pivot.desc" : "Excel utilizes pivot function to analyze data. Users can easily drag and drop rows/columns and view results. The Nexacro provides pivot function through an open source component called nexacro pivot.\nDedicated editors make it easy for both developers and users to apply pivot functionality.",
	"grid.pivot.largedata": "Large data pivot",
	"grid.pivot.largedata.desc": "Under Search Criteria, select the number of data (30,000/100,000/200,000/400,000) and click the Inquiry button. At the end of the query, the data is converted to be rendered in the pivot grid and displayed on the screen, separating the lookup time and pivot rendering time.\n\nDrag and drop rows/columns in the panel area to change the condition, click the 'Run' button, or press the 'AutoRun' button, and change the condition, depending on the changed option, a new pivot will be launched.",
	"grid.pivot.value.desc": "The formats expressed are sum, mean, count, maximum, and minimum, and if necessary, you can register and apply user functions.",
	"grid.pivot.export": "Export to Excel",
	"grid.pivot.export.desc": "Nexacro pivot is a component created by combining the basic components of the Nexacro. You can export a grid object using the ExcelExportObject object by returning it using the getPivotGrid function of the pivot component.\n\nPress the Excel download button on the screen.",
	"grid.dragndrop": "Drag & Drop",
	"grid.dragndrop.desc": "The ondrag and ondrop events provided by the Nexacro components allow users to organize the UI in a convenient way, such as dynamically creating columns in the grid or moving data.\n\nDrag a column from the list of columns on the left and drop it over the grid. Columns are dynamically generated in order and data can be viewed.\nFor multitasking at the bottom, select the check box before the column you want to add, drag and drop it on the grid. Press the reset button to delete all additional column information.",
	"grid.dragndrop.dragdesc": "Drag the column, drop it on the grid.",
	"grid.dragndrop.checkdesc": "Check and drag the columns, drop them on the grid.",
	"grid.dragndrop.reset": "Reset",
	"grid.dynamic": "Dynamic grid",
	"grid.dynamic.desc": "Drag the cell type to the left grid and drop it on the right grid to complete the form.",
	"grid.dynamic.clear": "Init",
	"grid.dynamic.save": "Save Format",
	"grid.dynamic.save.desc": "Save Format Success!",
	"grid.dynamic.init.desc": "Init Format Success!",
	"grid.dynamic.add": "Add Row/Column",
	"grid.dynamic.add.desc": "Right-click on the grid to dynamically add rows and columns.",
	"grid.dynamic.merge": "Row Merge",
	"grid.dynamic.merge.desc": "Select the cell area by dragging and dropping in the grid, and right-click to merge the columns. In the same way, the cogeneration is canceled.",
	"grid.dynamic.design": "Cell Design",
	"grid.dynamic.design.desc": "Right-click on the grid and add/delete a cell color (CSS) from the context menu.",
	"grid.quantum": "Quantum grid",
	"grid.quantum.area": "Drag the column and drop it here",
	"grid.quantum.desc": "A quantum grid is a hierarchical view of data grouped by row. When a column is dragged from the grid and placed in the upper area, data is grouped into the corresponding column. Conversely, if you drag the column name in the upper area and drop it on the lower grid, data grouping is canceled.",
	"comp.filetransfer":"File Transfer",
	"comp.filetransfer.delete":"Delete",
	"comp.filetransfer.transfer":"Transfer",
	"comp.filetransfer.downloadBtn":"Download",
	"comp.filetransfer.desc":"You can upload and download files to the server using components and objects provided by the Nexacro.",
	"comp.filetransfer.upload":"File Upload",
	"comp.filetransfer.upload.desc":"Click the Add button on the top grid to open the file explorer. Select a file to upload (multiple selection using the control key) and upload the file to be uploaded on the list. Alternatively, you can select a file by dragging the file from the explorer provided by the operating system and dropping it on the screen.Incorrectly selected files are excluded from the list to be uploaded to the server by selecting the file from the list and clicking the Delete button.When the file selection is complete, click the Submit button to upload the file to the server.",
	"comp.filetransfer.download":"File Download",
	"comp.filetransfer.download.desc":"Click the search button in the lower grid to search the list of files uploaded to the server. Select the file you want to download from the list and download the file using the download button.",
	"comp.fittocontents" : "Component size autofit",
	"comp.fittocontents.top.desc" : "The width and height of the component are automatically set according to the size of the text, and the position of the component set in relative coordinates moves accordingly. <fc v='#FE5252'>Arrangement</fc> and <fc v='#FE5252'>FitToContents</fc> properties have been applied.",
	"comp.fittocontents.desc" : "Adjusting the fittocontents property of a component reflects the size of the component according to the text length automatically.",
	"comp.binding":"Data two-way binding",
	"comp.binding.gender":"Gender",
	"comp.binding.birthday":"Birthday",
	"comp.binding.marriage":"Marital Status",
	"comp.binding.remark":"Remark",
	"comp.binding.information":"More Information",
	"comp.binding.desc":"Data binding means connecting the view and model together. Changing the data on the screen when the data in the model changes, and changing the data in the model when the data on the screen changes is called two-way binding.",
	"comp.animation": "Animation",
	"comp.animation.circlemenu": "Circle Menu",
	"comp.animation.imageslide": "Image Slide",
	"comp.animation.desc": "Animation features are used to highlight data or highlight specific features. For example, if you enter an incorrect value in the Edit component, you may want to add a slight shaking effect or emphasize that the data is updated.\n\nTo highlight the data displayed on the screen, the counter effect is also used by animation.",
	"comp.animation.easing.desc": "Specifies the rate at which animation effects are processed. There are three distinct values that specify the value of the easing property, except for \"linear\". The first part is accompanied by the string \"ease\". It is followed by a string of one of three strings: \"In\", \"Out\", and \"InOut\". Combining the two strings is a string called \"ease in\", which is a term used in the traditional animation industry. It means that the movement of an object begins slowly and becomes faster and faster. \"ease out\" is, on the contrary, starting fast and slowing down. They are also called \"slow in\" and \"slow out\". \"ease in out\" speeds up like a car, giving it the fastest speed at midpoint and slowing down as it passes through midpoint. The last string is to determine the timing of the change in detail.",
	"comp.arrangement.title" : "Convenient component arrangement",
	"comp.arrangement.desc" : "This is a function to set the position of the component to the relative position of a specific component rather than form-based. When the position of the reference component is moved, it automatically moves to the relative position as much as the set size. \nIt can be used effectively when there is a lot of dynamic handling of components. \nFor more detailed explanation, please refer to the manual! <u v='true'><l v='http://docs.tobesoft.com/edu_nexacro17_basic_kr#ab415e80eca7a28b'>http://docs.tobesoft.com</l></u>",
	"comp.chart": "Chart",
	"comp.chart.charttype": "Chart Type",
	"comp.chart.desc": "Nexacro Chart is an open source component implemented as a Nexacro.\n\nThe Nexacro chart module is not included in the basic installation. You must receive and add a separate module to use the Nexacro Chart component.\n\nYou can download the installation files from the Play Nexacro website.\nPlease refer to the website for installation precautions.\n<l v='https://www.playnexacro.com/#list:opensource:1'>https://www.playnexacro.com/#list:opensource:1</l>",
	"comp.components": "Components",
	"comp.components.desc" : "One of the most important elements in a web application is the UI control that connects the user and the system.\nNexacro Platform provides more than 60 UI components and improves work productivity by manipulating data to users through basic components such as buttons, edit boxes, grids, check boxes, and combos.\n\nIn addition, basic components such as sketches, videos, graphics, and MAP are included, providing extensions to the functionality when building a business system.\n\nAll components support multi-platform, multi-browser, and support web system to improve the cost of system construction",
	"comp.graphics": "Graphics",
	"comp.graphics.workflow": "Workflow",
	"comp.graphics.organizationchart": "Organization Chart",
	"comp.graphics.draw": "Draw",
	"comp.graphics.desc": "Graphics components provide the ability to draw lines or shapes. Graphics components allow developers to use HTML5 Canvas elements as if they were other components. Use the properties, methods, and events of the component to easily create the desired image on the script.\n\nGraphics components are not set by default when installing the Nexacro studio. You must register Graphics.json in the Project TypeDefinition and set the Graphics component as an object.",
	"comp.generate" : "Dynamic Component Generate",
	"comp.generate.sec" : "sec",
	"comp.generate.desc" : "It expresses the screen more quickly through the optimized component structure and rendering technology compared to the company's previous version.\nCheck out the rendering performance of Nexacro which quickly expresses a large amount of components through this demo.",
	"comp.generate.guide" : "Select the components to create, change the options and click the  'Create' button.",
	"comp.generate.select" : "Components",
	"comp.generate.option" : "Options",
	"comp.generate.gaptime" : "Time",
	"comp.generate.componentsamount" : "Selected",
	"comp.generate.amountperline" : "Display per lines",
	"comp.generate.lineamount" : "Lines",
	"comp.generate.total" : "Total components",
	"comp.generate.create" : "Generate",
	"comp.googlemap": "Google Map",
	"comp.googlemap.showmap": "Show Map",
	"comp.googlemap.addmaker": "Add Maker",
	"comp.googlemap.delmaker": "Delete Marker",
	"comp.googlemap.desc": "GoogleMap is a component that you use to print maps that Google provides on-screen. Google Maps requires creating HTML pages and loading them using Google-supplied APIs, but GoogleMap components make Google Maps easier to control.\n\nClick the 'Show Map' button. The GoogleMap component on the screen displays a map. Pressing the 'Add Marker' button will display the markers at the company position of TOBESOFT. Press the 'Delete Marker' button to remove the marker again.",
	"comp.menu": "Menu",
	"comp.menu.callMenu" : "Call Menu",
	"comp.menu.closeMenu" : "Close Menu",
	"comp.menu.call" : "Call !",
	"comp.menu.desc": "Various menu expressions provide flexibility for system configuration and user convenience.",
	"comp.menu.menutype": "Check out the various menus",
	"comp.menu.menutype.desc": "Please check each menu configuration.\nYou can see a variety of menu configurations.\nIn addition, you have the flexibility to express your desired menu configuration.",
	"comp.listview": "ListView",
	"comp.listview.component": "ListView Component",
	"comp.listview.menutype1": "You can express different formats.",
	"comp.listview.menutype2": "Supports detailed structure.",
	"comp.listview1.desc": "A component that represents data in unstructured format.\nIt is used to place content on a small screen, such as mobile, or to collect information about each content.",
	"comp.listview2.desc": "You can configure multiple formats to configure screens by size, such as Large, Medium, Small, or Device (PC, Tablet, Mobile).",
	"sample.popup": "Popup",
	"sample.popup.desc": "Popup",
	"sample.popup.call": "Popup Call",
	"sample.kakaotalk": "Kakaotalk Share",
	"sample.kakaotalk.desc": "Content can be shared using Kakao Link API or KakaoTalk message API provided by Kakao Developer. (URL:<l v='https://developers.kakao.com/'>https://developers.kakao.com/</l>)",
	"sample.personalization": "Web Widget",
	"sample.personalization.desc": "Recently, there has been a lot of demand for personalization features from system users. After changing the order or size of the column defined by the developer, I want the format to be maintained the next time I connect to the system.\nPersonalization functions can be used using API provided by grid of Nexacro and Local Storage provided by HTML5.",
	"sample.personalization.title01": "Bulletin Board(Work)",
	"sample.personalization.title02": "Integrated inquiry",
	"sample.personalization.widget": "Widget Menu",
	"sample.personalization.add": "Add",
	"sample.personalization.init": "Init",
	"sample.personalization.save": "Save",
	"sample.personalization.widgetmoving": "Widget moving",
	"sample.personalization.addwidget": "Add Widget",
	"sample.personalization.addwidget.desc": "Widgets can be configured and operated by users, and Demo Site allows them to select memos, calculators, and clocks to be added to the screen.",
	"sample.personalization.widgetmoving.desc": "You can change the location to Drag and Drop by selecting the desired widget.",
	"sample.personalization.default.desc": "If you press the 'Save' button to save this changed format information and access this screen again, the saved format will be automatically applied. Pressing the 'Initialization' button applies the default format defined by the developer.",
	"sample.restful": "RESTful",
	"sample.restful.sendrequest": "Send Request",
	"sample.restful.desc": "A REST API (also known as RESTful API) is an application programming interface that conforms to the constraints of REST architecture. REST stands for representational state transfer.\n\nAn API, or application programming interface, is a set of definitions and protocols for building and integrating application software. It's sometimes referred to as a contract between an information provider and an information user—establishing the content required from the consumer (the call) and  the content required by the producer (the response). For example, the API for a weather service could specify that the user supply a zip code and that the producer reply with a 2-part answer, the first being the high temperature, and the second being the low.\n\nIn other words, if you want to interact with a computer or system to retrieve information or perform a function, an API helps you communicate what you want to that system so it can understand and fulfill the request.\n\nYou can think of an API as a mediator between the users or clients and the resources they want to get. It's also a way for an organization to share resources and information while maintaining security and control—determining who gets access to what.\n\nAnother advantage of an API is that you don't have to know the specifics of how your resource is retrieved or where it comes from.\n\nUse this simple page to poke around at the API. Specify HTTP method, URL and parameters, and click on 'Send Request'. Note that this page requires a browser with HTML5 support.",
	"sample.reference": "Reference",
	"sample.reference.desc": "Take a look around various sites developed with Nexacro. Click on the thumbnail image to open the linked page.",
	"sample.portlet": "Drag & Drop",
	"sample.portlet.desc": "You can configure the portlet screen in the form of the Metro UI.\nTry repositioning the portlets with drag and drop.",
	"sample.hotkey": "Hot Key",
	"sample.hotkey.desc": "The reserved shortcut keys (F1, F5, F12) of the web browser operate while the screen is active.",
	"sample.hotkey.save": "Save Complete !",
	"sample.hotkey.alreadykey": "The key is already set.",
	"sample.hotkey.dataload": "Data Load",
	"sample.hotkey.setting": "Setting",
	"external.chart": "Chart",
	"external.chart.desc": "Riamoresoft's rMate Chart is a web chart component for desktops and mobile devices that enables rapid development through the world's largest number of chart types and 450 samples. A separate development kit is provided for ease of use on the Nexacro Platform.(URL: <l v='http://riamore.net/'>http://riamore.net/</l>)",
	"external.chartngrid": "Chart & Grid",
	"external.chartngrid.charttype": "Chart Type",
	"external.chartngrid.desc": "Riamoresoft's rMate Chart provides development kit (including JavaScript libraries, documents and samples) for easy use on the Nexacro Platform.\nFor related inquiries, please contact <l v='mailto:riamore@riamore.net'>riamore@riamore.net</l> or <l v='http://www.riamore.net/bbsNew/boards/tech'>http://www.riamore.net/bbsNew/boards/tech</l>",
	"external.report": "Report",
	"external.report.autogrid": "Auto (Grid)",
	"external.report.autopivot": "Auto (Pivot)",
	"external.report.sample": "Sample",
	"external.report.video": "Video",
	"external.report.autogridtitle": "Financial statements by industry",
	"external.report.autopivottitle": "Product Sales Performance Report",
	"external.report.sampletitle1": "CEO Dashboard",
	"external.report.sampletitle2": "Business Report",
	"external.report.sampletitle3": "Fund Report",
	"external.report.videotitle1": "Document Copy & Paste",
	"external.report.videotitle2": "DataSet Copy & Paste",
	"external.report.videotitle3": "e-form",
	"external.report.desc": "Ubi Report is a report solution that can be used in a variety of web browsers without installation.  It provides components for easy use in Nexacro Platform and provides automatic reporting using DataSet, Grid, and Pivot components.\nFor related inquiries, please contact <l v='mailto:ubireport@ubireport.com'>ubireport@ubireport.com</l> or <l v='http://www.ubireport.com/contact/contact.jsp'>http://www.ubireport.com/contact/contact.jsp</l>",
	"external.report.autogrid.desc": "A feature that automatically interprets the grid to create a report. Click the radio button to change the format of the grid and click the 'Preview' button. Ubi Report automatically create report files without having to create report files by format.\nDrag & drop the grid heads to change order or click the 'Preview' button after you click the head to sort the data. The report is created as it appears on the screen.",
	"external.report.autopivot.desc": "A feature that automatically interprets pivot grids to create reports. Try changing the Pivot's row/column, alignment, and filter conditions and clicking the Preview button.  The report is created as it appears on the screen.",
	"external.pdfviewer": "PDF Viewer",
	"external.pdfviewer.desc": "PDF.js or pdf.js is a JavaScript library that renders Portable Document Format (PDF) files using the web standards-compliance HTML5 Canvas.(URL: <l v='https://mozilla.github.io/pdf.js/'>https://mozilla.github.io/pdf.js/</l>)\n\nThe WebBrowser component of the Nexacro Platform makes it easy to link."
}